import Mock from "mockjs";

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/**
 * Mock.Random();
 *
 *
 */

let Random = Mock.Random;


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/**
 *
 *
 * Format	Example             Description
 *
 * yyyy	    1999 or 2003        一年的完整数字表示形式，4位数字
 * yy	    99   or 03          一年的两位数表示
 * y	    99   or 03          一年的两位数表示
 *
 * MM	    01   to 12          一个月的数字表示形式，前导零
 * M	    1    to 12          一个月的数字表示形式，不带前导零
 *
 * dd	    01   to 31          每月的某天，前两位为零
 * d	    1    to 31          没有前导零的月份中的一天
 *
 * HH	    00   to 23          一小时的24小时制，前导零
 * H	    0    to 23          一小时的24小时制，不带前导零
 * hh	    1    to 12          一小时的12小时格式（无前导零）
 * h	    01   to 12          一小时的12小时格式，前导零
 *
 * mm	    00   to 59          分钟，前导零
 * m	    0    to 59          分钟，不带前导零
 *
 * ss	    00   to 59          秒，前导零
 * s	    0    to 59          秒，不带前导零
 *
 * SS	    000  to 999         毫秒，前导零
 * S	    0    to 999         毫秒，不带前导零
 *
 * A	    AM   or PM          大写前子午和后子午
 * a	    am   or pm          小写的前子午线和后子午线
 *
 * T	    759883437303        毫秒，自1970-1-1 00:00:00 UTC
 */


//-------------------------------------------------------------------------------------------------------------------//


/**
 * Random.date(format?);
 *
 *
 * 返回一个随机的日期字符串
 */

console.log("Random.date(): ", Random.date());

console.log("Random.date('yyyy-MM-dd'): ", Random.date('yyyy-MM-dd'));

console.log("Random.date('yyyy-MM-dd'): ", Random.date('yyyy-MM-dd : HH-m-ss'));

console.log("Random.date('yyyy-MM-dd'): ", Random.date('yyyy-MM-dd : HH-m-ss'));


//-------------------------------------------------------------------------------------------------------------------//


/**
 * Random.time(format?);
 *
 *
 * 返回一个随机的日期和时间字符串
 */


console.log("Random.time(): ", Random.time());

console.log("Random.time('A HH:mm:ss SS'):", Random.time('A HH:mm:ss SS'));


//-------------------------------------------------------------------------------------------------------------------//


/**
 * Random.now(unit?, format?);
 *
 *
 * @unit: year, month, week, day, hour, minute, second, week        // 此选项格式后的单位为 0
 *
 *
 * 返回当前日期和时间字符串
 */

console.log("Random.now(): ", Random.now());

console.log("Random.now('week'): ", Random.now('week'));

console.log("Random.now(): ", Random.now());


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////