import Mock from "mockjs";

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/**
 * Mock.Random();
 *
 *
 */

let Random = Mock.Random;


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/**
 * Random.url(protocol?, host?);
 *
 *
 * @protocol: 指定 URL 协议。例如 http
 * @host: 指定 URL 域名和端口号
 *
 *
 * 随机生成一个 URL
 */

console.log("Random.url(): ", Random.url());

console.log("Random.url('http'): ", Random.url('http'));

console.log("Random.url('http', 'alpha.com'): ", Random.url('http', 'alpha.com'));


//-------------------------------------------------------------------------------------------------------------------//


/**
 * Random.protocol();
 *
 *
 * 随机生成一个 URL 协议，返回以下值之一
 *
 *
 * 'http'、'ftp'、'gopher'、'mailto'、'mid'、'cid'、'news'、'nntp'、'prospero'、'telnet'、'rlogin'、'tn3270'、'wais'
 */

console.log("Random.protocol(): ", Random.protocol());


//-------------------------------------------------------------------------------------------------------------------//


/**
 * Random.domain();
 *
 *
 * 随机生成一个域名
 */

console.log("Random.domain(): ", Random.domain());


//-------------------------------------------------------------------------------------------------------------------//


/**
 * Random.tld();            // Top Level Domain
 *
 *
 * 随机生成一个顶级域名
 */

console.log("Random.tld(): ", Random.tld());


//-------------------------------------------------------------------------------------------------------------------//


/**
 * Random.email(domain?);
 *
 *
 * @domain: 指定邮件地址的域名
 *
 *
 * 随机生成一个邮件地址
 */

console.log("Random.email(): ", Random.email());


//-------------------------------------------------------------------------------------------------------------------//


/**
 * Random.ip();
 *
 *
 * 随机生成一个 IP 地址
 */

console.log("Random.ip(): ", Random.ip());


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////